package sillyname

import (
	"math/rand"
	"time"
	"unicode"
)

var adjectives = []string{"שחור", "לבן", "אפור", "חום", "אדום", "ורוד", "ארגמן", "קרנליאן", "תפוז", "צהוב", "שנהב", "קרם", "ירוק", "וירידיאן", "תרשיש", "ציאן", "כחול", "תכלת", "אינדיגו", "חיל הים", "סגול", "אזוביון", "מגנטה", "קשת", "ססגוני", "ספקטרום", "פריזמה", "נועז", "בהיר", "חיוור", "ברור", "זכוכית", "שקוף", "ערפילי", "אפל", "אור", "זהב", "כסף", "נחושת", "ארד", "פלדה", "ברזל", "פליז", "כספית", "אבץ", "פלטינה", "טיטן", "ניקל", "עופרת", "בדיל", "חלודה", "מתכת", "אבן", "קורץ", "גרניט", "שיש", "בהט", "ברקת", "ישפה", "חלוק", "פיריט", "קריסטל", "נציץ", "צור", "חול", "חצץ", "סלע", "בזלת", "אודם", "תרשיש", "אדום", "סיטרין", "סלפר", "טופז", "ענבר", "ברקת", "מלכיט", "ירקן", "אבלונה", "לאפיס", "ספיר", "יהלום", "פרידוט", "פנינה", "תכשיט", "שפוע", "אלמוגים", "סילון", "הבנה", "עץ", "עץ", "דובדבן", "אדר", "ארז", "סניף", "אטד", "אפר", "אשוח", "צנובר", "קקטוס", "אלמון", "חורשה", "יער", "ג'ונגל", "כף יד", "שיח", "תות", "ערער", "גפן", "קיסוס", "שושן", "צבעוני", "נרקיס", "יערה", "לוז", "אגוזי מלך", "שקד", "ליים", "לימון", "תפוח", "פריחה", "כרכום", "נורית", "קשתית", "צפורן", "שרך", "שורש", "סניף", "עלה", "פרח", "עלי כותרת", "אבקה", "סחלב", "מנגרוב", "ברוש", "סקויה", "מרווה", "אברש", "לוע הארי", "חננית", "הר", "גבעה", "ערמונים", "עמק", "קרחון", "יער", "חורשה", "גיא", "עץ", "קוץ", "מדבר", "קניון", "דיונה", "נוה", "מיראז'", "האביב", "אחו", "שדה", "ערבה", "דשא", "אי", "החוף", "חול", "פגז", "לגלוש", "גל", "קצף", "גאות", "אגם", "נהר", "פלג", "זרם", "הפול", "אגם", "קורט", "צל", "גשם", "ענן", "סערה", "ברד", "שלג", "רעם", "ברק", "רוח", "הוריקן", "טיפון", "שחר", "זריחה", "שחרית", "הצהריים", "בין שמשות", "שקיעה", "חצות", "לילה", "שמים", "כוכב", "כוכבים", "שביט", "ערפילית", "סולרי", "ירחי", "פלנטה", "מטאור", "נבט", "אגס", "שזיף", "קיווי", "ענבה", "משמש", "אפרסק", "מנגו", "אננס", "קוקוס", "זית", "ג'ינג'ר", "שורש", "מישור", "דמיון", "פס", "מקום", "רבב", "טבעת", "להקה", "להבה", "צבע", "מנומר", "צל", "חתול", "מנומר", "טלאי", "בודק", "נקודה", "דפוס", "נצנוץ", "נצנוץ", "הבלחה", "אבק", "עפר", "קוניה", "שריטה", "מהיר", "מהיר", "חכם", "זיק", "פלאש", "גחלת", "פחם", "להבה", "שוקולד", "וניל", "סוכר", "תבלין", "עוגה", "פאי", "עוגייה", "סוכריות", "קרמל", "ספירלי", "עגול", "ג'לי", "רבוע", "צר", "ארוך", "קצר", "קטן", "זעיר", "גדול", "ענק", "אטום", "נענע", "חמאה", "ציצית", "סמרטוט", "כסת", "אמת", "שקר", "קדוש", "אצילי", "ערמומי", "אמיץ", "ביישן", "לבה", "מאוס", "עור", "פנטזיה", "להוט", "זורח", "נוצה", "דביק", "קורי עכביש", "כותנה", "טרטור", "משי", "סטין", "חוט", "דנים", "פלנל", "אריג משובץ", "צמר", "פשתן", "שקט", "חלש", "אמיץ", "עז", "עדין", "סנסציה", "צפון", "דרום", "קיץ", "חורף", "סתיו", "האביב", "עונה", "עיתון", "ססגוני", "לפיד", "בליסטי", "משתולל", "נמש", "פרא", "חינם", "שרשרת", "טהור", "משוגע", "נר", "סרט", "תחרה", "חריץ", "דונג", "לזרוח", "רדוד", "עמוק", "בועה", "קציר", "מוך", "ארס", "בום", "לקצץ", "רונה", "קר", "נוצה", "אהבה", "שונא", "נופך", "זירקון", "כוח", "עצם", "חלל", "קרן", "תפארת", "סייבר", "נובה", "חם", "חלזונית", "קוסמי", "קווארק", "אשפה", "אדר מצוי", "תלתן", "קוטבי", "מלכותי", "אדוה", "הבנה", "חיטה", "דמיוני", "טל", "אזמל", "סדק", "פטפוט", "לייזר", "לסכל", "פח", "חכם", "אוצר", "מבוך", "מפותל", "מתולתל", "מזל", "גורל", "חמוד", "רפש", "דיו", "דיסקו", "נוצה", "זמן", "פסיכודלי", "שיר", "מאובן", "מים", "פראי", "עתיק", "מהיר", "כביש", "שביל", "תפר", "לחצן", "קשת", "זריז", "התלהבות", "חמוץ", "מרים", "שלב", "מאוורר", "ציצית", "כבשתי", "בוץ", "שלולית", "אגם", "נהר", "האביב", "זרם", "קרב", "חץ", "נוצה", "רואן", "פסיעה", "זפת", "חתול", "כלב", "סוס", "לטאה", "עוף", "דג", "סיף", "חרמש", "חד", "רך", "תער", "ניאון", "גנדרן", "להציף", "בצה", "כבול", "רקבובית", "יריד", "רק", "לבנה", "חידה", "שן", "מזלג", "שקע", "קודר", "להשתות", "מזל", "קפה", "מפוצל", "שבב", "חלול", "כבד", "מקרא", "היקורי", "סרפד", "נוכלים", "קסם", "קוצי", "חרוז", "ספוג", "שוט", "קרח", "כפור", "ערפל", "רעלה", "צוק", "הר געש", "קרע", "מבוך", "גא", "טל", "ראי", "חרס", "מלח", "פלפל", "דבש", "חוט", "זיף", "אדוה", "להט"}

var nouns = []string{"ראש", "סמל", "כתר", "שן", "ניב", "קרן", "ציצית", "גולגולת", "עצם", "לשון", "גרון", "קול", "אף", "חוטם", "סנטר", "עין", "מראה", "רואה", "רמקול", "זמר", "שיר", "לחן", "מתרע", "פטפוט", "צרחן", "צריחה", "לסת", "לנשוך", "עורף", "כתף", "סנפיר", "כנף", "זרוע", "מרים", "אחיזה", "חוטף", "יד", "רגל", "אצבע", "אגודל", "טפר", "כף יד", "לגעת", "רוכב", "רץ", "פרסה", "לעוף", "טיס", "לעוט", "שאגה", "שריקה", "פלונטר", "צוללן", "צלע", "חזה", "בחזרה", "רכס", "רגל", "רגליים", "זנב", "מקור", "הליכון", "מצליף", "גלף", "בעטן", "שואג", "מגרסה", "קוץ", "מטרף", "מטען", "ציד", "אורג", "כורך", "סופר", "מוזה", "פקיעה", "קוטלת", "העוקב", "מסלול", "גשש", "צלקת", "פחד", "מרפא", "מציל", "חבר", "אויב", "רעם", "ברק", "ענן", "סערה", "מזייף", "סולם", "שערה", "צמה", "עורף", "בטן", "קוצר", "נותן", "לוקח", "רקדן", "שחקן", "מהמר", "מסלף", "חרט", "צייר", "חץ", "עוקץ", "ארס", "שלוחה", "זולל", "אביר", "גברת", "אדון", "מלכה", "מלך", "פילגש", "נסיך", "נסיכה", "דוכס", "סמוראי", "הנינג'ה", "ג'ק", "עבד", "משרת", "מרווה", "אשף", "מכשפה", "מכשף", "לוחם", "ליצן", "פלדין", "משורר", "סוחר", "חרב", "סכין", "פגיון", "חץ", "קשת", "לוחם", "רעל", "חסיד", "מנהיג", "שוט", "תצפיתן", "חתול", "פנתר", "נמר", "פומה", "יגואר", "אוצלוט", "לינקס", "נמר", "סמור", "לשאת", "רקון", "כלב", "זאב", "חתלתול", "כלבלב", "גור", "שועל", "שפלן", "צבוע", "תן", "חזיר", "סוס", "חמור", "סוסה", "זברה", "אנטילופה", "צבי", "צבי", "תאו", "ביזון", "חזיר", "דישון", "לווייתן", "דולפין", "כריש", "דג", "דגיג", "סלמון", "קרן", "דיג", "לוטרה", "שחף", "ברווז", "אוזה", "עורב", "עוף", "נשר", "נץ", "בז", "מוז", "אנפה", "ינשוף", "חסידה", "מנוף", "דרור", "אדום חזה", "תוכי", "קקדו", "קרפיון", "לטאה", "שממית", "איגואנה", "נחש", "פיתון", "צפע", "חנק", "קונדור", "נשר", "עכביש", "לעוף", "אנפה", "דבורה", "צרעה", "ארנב", "ארנבת", "מצח", "מוסטנג", "שור", "חלילן", "נצנץ", "עש", "מסכה", "גיבור", "קור", "ילר", "פנינה", "מיתוס", "שדון", "פיה", "דרקון", "גריפין", "חדקרן", "פגסוס", "שדון", "מסוק", "מבצעה", "פרפר", "אגדה", "נודד", "טבלן", "נושא רומח", "זכוכית", "גלזר", "להבה", "גביש", "פנס", "גלימה", "פעמון", "צלצלן", "שומר", "קינטור", "בריח", "לכדן", "עכברוש", "עכבר", "נחש", "קוץ", "שוט", "רוכב", "רוח", "זקיף", "עטלף", "חיפושית", "ברדס", "אבן", "פנינה", "קולר", "סימן", "לגחך", "חנית", "תער", "קצה", "שוחר", "עורבני", "קוף", "גורילה", "קואלה", "קנגורו", "יק", "עצלן", "נמלה", "אוכל", "תער", "חולצה", "פנים", "משמרת", "רוכב", "פנים", "חפרפרת", "נברן", "פיראט", "לאמה", "צבי", "חרק", "כובע", "מגף", "ירידה", "מחבק", "סרג'נט", "שטיח", "וילון"}

func randomNoun() string {
	return nouns[rand.Intn(len(nouns)-1)]
}

func randomAdjective() string {
	return adjectives[rand.Intn(len(adjectives)-1)]
}

func uppercaseFirstLetter(word string) string {
	a := []rune(word)
	a[0] = unicode.ToUpper(a[0])
	return string(a)
}

func lowercaseFirstLetter(word string) string {
	a := []rune(word)
	a[0] = unicode.ToLower(a[0])
	return string(a)
}

func GenerateStupidName() string {
	rand.Seed(time.Now().UnixNano())
	noun1 := randomNoun()
	adjective := randomAdjective()
	return noun1 + " " + adjective
}
